{
    "data": [
        {
            "title": "Fire Extinguisher Safety - AFIRE100.mp4",
            "video_path": "resources/videos/Fire Extinguisher Safety - AFIRE100.mp4",
            "transcript": "you you the first rule of firefighting is get help but in the event that you use a fire extinguisher proper understanding will help us all maintain maximum protection after completing this module you will be able to state company policies and procedures regarding fire extinguisher safety and attempting to fight fires identify hazards associated with the initial stage of fighting a fire identify general principles of fire extinguisher use you there are several fire extinguisher safety considerations for you to keep in mind select each consideration to learn more you you you you you there are four classes or types of fire extinguisher to target different types of fires you can identify fire extinguisher type through labels using a letter and icon system if you choose to fight a fire do not use water use the appropriate fire extinguisher keep in mind that fire extinguishers are only to be used for small fires select each type of extinguisher to learn more you you you you you you some fire extinguishers can be used on several different types of fire select each image to learn more you you you there are four steps to correctly use a fire extinguisher you can easily remember them as P a s s or pass step 1 is P pull the pin step 2 is a aim at the base of the fire step 3 is s squeeze the trigger and step 4 is s sweep the hose side to side select each step to learn more you the occurrence of fire on the job is rare but if one should occur it is essential that you know how to respond to the situation select each type of fire to learn more you you you you you\n",
            "image_summary": "The \"Fire Extinguisher Safety\" course (AFIRE100) covers essential skills and knowledge for understanding fire safety and the proper use of fire extinguishers. Key components of the training include:\n\n1. **Introduction to Fire Extinguishers**: Overview of types and classes of fire extinguishers (A, B, C, D).\n2. **Safety Considerations**: Guidelines on inspection, proper mounting, and installation of fire extinguishers, along with risks associated with their use.\n3. **Using a Fire Extinguisher**: The PASS technique (Pull, Aim, Squeeze, Sweep) is emphasized for effective use.\n4. **Responding to Fires**: Procedures for dealing with various fire scenarios, including those on ramps and aircraft.\n5. **Assessment**: An interactive quiz to gauge understanding and retention of the material covered.\n\nThe course aims to ensure participants can identify types of fires, use extinguishers properly, and understand safety protocols, thereby achieving a proficient level of fire safety awareness and response.",
            "labeled_skills": [
                {
                    "Skill": "Workplace Safety",
                    "Proficiency": "Basic",
                    "Description": "Demonstrates ability to apply basic understanding of concepts in common situations under supervision. Requires frequent guidance."
                },
                {
                    "Skill": "Emergency Procedures",
                    "Proficiency": "Basic",
                    "Description": "Demonstrates ability to apply basic understanding of concepts in common situations under supervision. Requires frequent guidance."
                },
                {
                    "Skill": "Safety Assurance",
                    "Proficiency": "Basic",
                    "Description": "Demonstrates ability to apply basic understanding of concepts in common situations under supervision. Requires frequent guidance."
                }
            ]
        },
        {
            "title": "fingers.mp4",
            "video_path": "resources/videos/fingers.mp4",
            "transcript": "Welcome to the LMS course that will cover the WRAPVAC program to capture fingerprints at Delta Airlines. After this training, you should be able to log into the PC, verify that the day on capture service is running in the background, open and log into the new fingerprinting portal, add a new applicant, and capture their fingerprints. Section 1, Logging into the PC. When you start, you will be presented with a login screen. Press Control-Alt-Delete to unlock the PC. After pressing Control-Alt-Delete, you will be presented with Delta Airlines acceptable use policy. Click OK to confirm. Enter your username and password and click the submit arrow or press enter on the keyboard. Section 2, After logging in, please wait for the user account control prompt to start. It will ask you, do you want to allow this app from an unknown publisher to make changes to your device? Please validate that the service in question says day on service systray.exe. If it does, click yes to allow the service to start running in the background. Section 3, Validating that day on capture biometric service is running in the background. The bar running along the bottom of the screen is the system start menu. To the far right of the start menu, where the system clock resides, is called the system tray. If you need to expand the system tray to see if day on capture service is running, click the up caret or arrow in the system tray to see additional programs running. If you see the icon that looks like a black square with a yellow X, if you hover over it, you will see day on capture biometric support service system tray. This means that the service is indeed running in the background. Section 4, Opening the AAAE TSC's webpage. On the desktop of each fingerprinting laptop, you should see an icon labeled AAAE TSC Fingerprinting. Double click the shortcut and wait for the corresponding webpage to open. Section 5, Logging into the TSC portal. Please note that the very first time you log into the system, you will be provided a temporary password. This system will prompt you to change your password to something new that meets the system's password complexity rules. Enter your Delta email address under email slash username. Enter your self-created password under password and click log in. Section 6, Web Enroll. After logging into the portal, the system will take you to your landing page depending on your assigned role in the clearinghouse. Click on Web Enroll from the horizontal navigation bar at the top of the screen. Once the Web Enroll page loads, enter the three required pieces of information, last name, first name, date of birth. Click the search button. The system then goes and queries the list of applicants that are stored in the database. If it finds a match based on any of the provided information, Jane, first name, or last name Doe, or date of birth, you'll see that the entries are returned in the screen below. We can see that the entry return does not match the entry that we're trying to add, so what we'll do is we'll click Add New Applicant. You will see a prompt that says there is a potential match to your search. If you proceed, you will be creating a new applicant. Do you want to proceed? Since they are not an exact match, we will click yes to proceed. After the Add New Applicant page opens, you will be presented with six tabs, Applicant, Alias, Address, Telephone Email, Documents, and Fingerprint. Under Applicant, fill out the applicant's required information where applicable. Also include all biographic information and birth information. Click the Next button to proceed to the next tab, Alias. If the applicant has any additional aliases, enter them under this section. Our test applicant does not have an alias, so we'll proceed by clicking Next to move to the next tab, Address. To add an address for the applicant, street to, if applicable, city, key in the zip code, and then the country. Once you key in all of the form information, click Update to save the address to the record. Click Next to proceed to the next tab, Telephone slash Email. To add a telephone number, click the Add Telephone button. Select the type of telephone number it is. In this case, it's a mobile number, and we will key in the corresponding phone number. Update. Key in an email address for the applicant as well. Click the Add Email button. The email address. Click the blue Update button to save the email address to the record. Click the Next button. This will take you to the Documents tab. Because at this moment, we will not be appending any documents to the records, click Next. This takes you to the Fingerprint tab. Click the Submit button. Once clicking Submit, you should receive a confirmation that your applicant was submitted successfully. Section 7, Capturing Fingerprints. After submitting the applicant and receiving the confirmation that the applicant was submitted successfully, we want to click the Work Queue button from the horizontal navigation bar at the top of the screen. Click Work Queue. On the Work Queue page, we will see a list of the applicant that we just entered. If there were multiple applicants being acquired by multiple fingerprinting technicians, those would show here too as well. So you would see a list of all of the applicants that need an action taken against them. Under the Background Check Status, we'll see that the record that we just entered, Jane Doe's record, is awaiting prints. Under the Actions column, we'll see three icons. The first one will be View. The second will be Update. The third will be Live Scan. View will enable you to see all of the entered information for the applicant. Update will enable you to go back and to correct any invalid information, i.e. typos or misselections from dropdowns. Live Scan will enable you to capture the print. To capture the fingerprints, click the Live Scan icon. After clicking the Live Scan icon, the system will appear the fingerprinting technician has to click the checkbox that corresponds to Identity Verified. They also have to key in the type of Identity Verification document used. Click Submit. Since we currently will not be appending any documents to the record, i.e. we will not be capturing a picture of the Identity Verification document used, we'll just click Next. This will take us to the Live Scan fingerprint capture page. The right half of the screen, you will see a dropdown that says Select Device. Here at Delta, there are two types of possible fingerprinting devices, CrossMatch and Greenbit. They should have a label on the front of them. Select from the list the corresponding device that is connected to your fingerprinting laptop. In this case, I have a CrossMatch device connected to this test laptop, so we'll select CrossMatch. Before clicking Start to begin the process, please note that if the individual has an amputated finger or fingers, you must click the finger that corresponds with the amputation on the client on the virtual hand on the left half of the screen. Change it to blue for amputated or gray for unprintable. For unprintable, the system will still attempt to read the print. If it is successful, it will override the user selection. If it is unsuccessful after three attempts, it will proceed forward and allow the fingerprinting process to proceed. Since I don't have an amputation, we will not click any of the fingers. But if you did need to click the fingers, you just click the finger to change the color to correspond with the finger state. To begin the process of capturing my fingerprints, click the Start button. Have the individual place their left hand on the scanner and hold it there. The system then will capture that left four fingers on the left hand. You should notice that the dropdown that corresponds to the hand or fingers changed to the right hand. Now, you want to click Start to capture the right hand. You should now see that the right hand's fingers were captured and they show as green on the left-hand side. So, the prints were successfully captured. Now, the system moves us to both thumbs. To capture both thumbs, click Start. Have the individual place two thumbs on the scanner, and then the scanner should pick up the thumbs and upload the thumbs to the applicant's record. Once the left hand is captured, the right hand is captured, and both thumbs are captured. You will see a new button appear on the screen in green. Click the Complete Fingerprint Capture button to complete the fingerprint capture process. You will now see in the work queue that the background check status for the applicant that we just took fingerprints for changed from Awaiting Prints to Receive. The prints have now been submitted. Thank you. Thank you. Thank you. \n",
            "image_summary": "The \"Fingerprint Capture Training\" video for Delta's Fingerprint Technicians focuses on equipping participants with the essential knowledge and skills required for their roles. \n\n### Key Skills Learned:\n1. **Understanding Compliance**: Technicians learn to ensure compliance with government regulations related to fingerprinting.\n2. **Use of Technology**: Training includes how to operate fingerprint capture devices efficiently.\n3. **Identification Procedures**: Emphasis on verifying individual identities accurately.\n4. **Data Management**: Skill in entering and managing applicant information through relevant systems.\n\n### Proficiency Levels:\n- **Basic Proficiency**: Understanding of compliance regulations and general procedures.\n- **Intermediate Proficiency**: Ability to operate fingerprint capture technology and manage data effectively.\n- **Advanced Proficiency**: Mastery of intricate identification processes and problem-solving in unique scenarios.\n\nThe training aims to build foundational knowledge and progressively develop technical competencies in fingerprint capture for enhanced security measures.",
            "labeled_skills": [
                {
                    "Skill": "Aviation Knowledge",
                    "Proficiency": "Basic",
                    "Description": "Demonstrates ability to apply basic understanding of concepts in common situations under supervision. Requires frequent guidance."
                },
                {
                    "Skill": "Federal Aviation Regulations",
                    "Proficiency": "Basic",
                    "Description": "Demonstrates ability to apply basic understanding of concepts in common situations under supervision. Requires frequent guidance."
                },
                {
                    "Skill": "Data & Records Management",
                    "Proficiency": "Basic",
                    "Description": "Demonstrates ability to apply basic understanding of concepts in common situations under supervision. Requires frequent guidance."
                }
            ]
        },
        {
            "title": "Information Security Awareness - Standard (Recurrent).mp4",
            "video_path": "resources/videos/Information Security Awareness - Standard (Recurrent).mp4",
            "transcript": "None",
            "image_summary": "The \"Information Security Awareness - Standard (Recurrent)\" course is designed for all Delta employees and contractors to enhance their understanding of cybersecurity practices. \n\n### Course Overview:\n- **Goals:** Equip employees with knowledge regarding Delta's Acceptable Use Policy, information security protocols, and common cyber threats.\n- **Languages:** Offered in English and Spanish.\n- **Duration:** 0.5 credit hours.\n\n### Key Skills and Topics Covered:\n1. **Social Engineering:**\n   - Introduction and techniques.\n   - Common attacks and identifying features of phishing messages.\n\n2. **Password Management:**\n   - Importance of strong passwords and Delta’s password policy.\n   - Techniques to create secure passwords.\n\n3. **Safe Web Browsing:**\n   - Common internet threats and best browsing practices.\n  \n4. **Incident Reporting:**\n   - Types of security incidents.\n   - Procedures on how to report suspicious emails and incidents effectively.\n\n### Proficiency Levels:\n- Completion involves engaging with learning activities and assessments to reinforce knowledge and ensure understanding of security protocols.\n\nThis course emphasizes practical skills to recognize and respond appropriately to security threats, thereby fostering a culture of vigilance within the organization.",
            "labeled_skills": [
                {
                    "Skill": "Cyber Risk",
                    "Proficiency": "Awareness",
                    "Description": "Demonstrates foundational understanding of concepts and practical application. Requires extensive guidance to apply concepts."
                },
                {
                    "Skill": "Incident Response",
                    "Proficiency": "Awareness",
                    "Description": "Demonstrates foundational understanding of concepts and practical application. Requires extensive guidance to apply concepts."
                },
                {
                    "Skill": "Network Security",
                    "Proficiency": "Awareness",
                    "Description": "Demonstrates foundational understanding of concepts and practical application. Requires extensive guidance to apply concepts."
                },
                {
                    "Skill": "Identity And Access Management",
                    "Proficiency": "Awareness",
                    "Description": "Demonstrates foundational understanding of concepts and practical application. Requires extensive guidance to apply concepts."
                },
                {
                    "Skill": "Writing",
                    "Proficiency": "Awareness",
                    "Description": "Demonstrates foundational understanding of concepts and practical application. Requires extensive guidance to apply concepts."
                }
            ]
        }
    ]
}