{
    "data": [
        {
            "title": "CCT - Privacy and Data Protection",
            "description": "This is a sample video for testing",
            "summary": "The image sequence appears to show a series of screenshots from a learning management system, detailing a course titled \"Privacy and Data Protection (DL PRIVACY).\" The course is designed to educate Delta employees on essential data privacy and protection knowledge, covering employee roles, responsibilities, and the importance of data privacy. The images illustrate the structure and completion status of the course, highlighting mandatory assignments and completion dates. Users navigate through the career portal, start and complete the course, and receive feedback and scores. The interactive elements include hotspots, multiple-choice questions, and decryption challenges, emphasizing the practical application of data privacy principles. The course concludes with reminders of key privacy principles and appreciation messages, reinforcing the importance of data protection within Delta's culture.",
            "video_path": "/CCT - Privacy and Data Protection.mp4",
            "timestamp": "2025-03-20T18:58:41.467304",
            "labels": [
                "Data & Records Management",
                "Data Integrity",
                "Data Management",
                "Identity And Access Management",
                "Regulatory Compliance",
                "Regulatory Requirements",
                "Training And Development"
            ]
        },
        {
            "title": "Fire Extinguisher Safety",
            "description": "This is a sample video for testing",
            "summary": "The image sequence depicts a user navigating an online learning management system (LMS) to access and complete a course titled \"Fire Extinguisher Safety.\" The course, identified by the code AFRE100, guides users through various sections including an introduction, navigation instructions, welcome message, objectives, detailed fire extinguisher safety information, specific guidelines for Delta and Delta Connection Carriers, different types of fire extinguishers, and practical instructions on using a fire extinguisher. The module also covers how to respond to fires on ramps and in aircraft, and includes an assessment to verify the user's understanding. The interface is user-friendly, featuring progress tracking, interactive elements like drag-and-drop activities, and clear navigation options to ensure comprehensive learning and course completion.",
            "video_path": "/Fire Extinguisher Safety - AFIRE100.mp4",
            "timestamp": "2025-03-20T18:58:41.467304",
            "labels": [
                "Emergency Procedures",
                "Safety Training",
                "Workplace Safety"
            ]
        },
        {
            "title": "Delta Incident Reporting training course video capture (NO AUDIO)",
            "description": "This is a sample video for testing",
            "summary": "The series of images depicts a user navigating through a learning management system (LMS) called \"My Career Portal.\" The user interacts with various sections of the portal, including \"My Learning Assignments,\" \"Learning History,\" and \"Featured\" courses. The user selects and launches a course titled \"Corporate Safety: Incident Investigation,\" which involves gathering witness statements, taking photographs, creating diagrams, and recording measurements. The course emphasizes the importance of thorough investigation techniques, such as asking \"why\" to uncover root causes and identifying human factors contributing to incidents. The user completes an assessment, receives a certificate of completion, and reviews their learning history on the portal. The interface includes navigation menus, search bars, and quick links to facilitate access to learning resources and other functionalities.",
            "video_path": "/Delta Incident Reporting training course video capture (NO AUDIO).mp4",
            "timestamp": "2025-03-20T18:58:41.467304",
            "labels": [
                "Compliance Training",
                "Investigation",
                "Root Cause Analysis",
                "Safety Assurance",
                "Safety Standards",
                "Safety Training",
                "Workplace Safety"
            ]
        },
        {
            "title": "Corporate Safety - Incident Investigation",
            "description": "This is a sample video for testing",
            "summary": "The image depicts a screenshot of an online course titled \"Corporate Safety: Incident Investigation\" hosted on Delta Airlines' My Career Portal, part of the SuccessFactors Learning Center. The course, identified by the code \"DLS38101,\" focuses on the importance of investigating incidents to reduce or eliminate future events. Key elements include a welcome message, learning objectives such as determining why incidents are investigated and identifying types of incidents, and navigation instructions. The course is part of a learning history under the \"Corporate Safety\" category and includes visual elements like images of aircraft and safety personnel. The URL indicates it is hosted on a Delta Airlines platform, suggesting it is tailored for Delta employees.",
            "video_path": "Corporate Safety - Incident Investigation.mp4",
            "timestamp": "2025-03-20T18:58:41.467304",
            "labels": [
                "Investigation",
                "Safety Assurance",
                "Safety Standards",
                "Workplace Safety"
            ]
        },
        {
            "title": "Interview Skills For Hiring Managers",
            "description": "This is a sample video for testing",
            "summary": "The image sequence depicts a series of screenshots from an online learning platform, specifically focused on a course titled \"Interview Skills for Hiring Managers.\" The course is designed to help employees who conduct interviews, even without direct reports, to enhance their interview skills. Key elements include an overview of the course, detailed steps for conducting structured interviews, tips for effective note-taking and scoring, and a knowledge check to ensure understanding. The course emphasizes the importance of consistency, fairness, and professionalism in the interview process, providing a structured approach to evaluating candidates effectively.",
            "video_path": "/Interview Skills For Hiring Managers.mp4",
            "timestamp": "2025-03-20T18:58:41.467304",
            "labels": [
                "Talent Acquisition",
                "Job Analysis",
                "Job Evaluation",
                "Recruitment Strategies",
                "Recruitment Planning",
                "Conflict Resolution",
                "Persuasive Communication",
                "Professionalism",
                "Telephone Skills",
                "Public Speaking",
                "Presentations",
                "Coaching",
                "Training And Development",
                "Adult Learning Principles",
                "Instructional Design",
                "Curriculum Development",
                "Training And Development"
            ]
        },
        {
            "title": "Information Security Awareness - Standard (Recurrent)",
            "description": "This is a sample video for testing",
            "summary": "The image sequence appears to show a user's interaction with an online learning platform, specifically focusing on completing a course related to \"Information Security Awareness - Standard (Recurrent).\" Here is a detailed summary of the images:\n\n### Initial Screen\n1. **Course Title and Verification Button**:\n   - The first image shows the course title \"Information Security Awareness - Standard (Recurrent)\" with a \"Verify course completion\" button. This suggests that the user is about to verify if they have completed the course.\n\n### Completion Pop-up\n2. **Congratulatory Message and Options**:\n   - The subsequent images display a pop-up window indicating that the course has been completed. The pop-up includes a congratulatory message, a recommendation button, and options to \"Go to My Learning\" or \"Print Certificate.\"\n\n### Confirmation of Completion\n3. **Completion Screen**:\n   - The final image shows a screen confirming that the course has been completed. The word \"Completed\" is prominently displayed, along with a checkmark icon, signifying that the user has successfully finished the course.\n\n### Detailed Summary of the Course and Platform\n\n#### Course Overview\n- **Title**: Information Security Awareness - Standard (Recurrent)\n- **Course Code**: DLISK-S-R\n- **Provider**: My Career Portal\n\n#### Key Sections and Content\n1. **Introduction**:\n   - The course emphasizes the importance of information security and awareness.\n   - It highlights the need for compliance with various laws, regulations, and policies, including the Information Technology Acceptable Use Policy, Code of Ethics, and Business Conduct.\n\n2. **Training and Awareness**:\n   - **Delta Information Security Training**:\n     - Delta provides annual information security awareness training tailored to its business environment.\n     - The training is updated as new technology, security issues, and privacy concerns emerge.\n     - New hires must complete the training within 90 days of hire.\n     - Existing users must complete the annual training within the allocated period.\n   - **Prohibited Sharing**:\n     - Users are prohibited from sharing Delta information publicly or with those who do not have a need to know.\n   - **Access Principles**:\n     - Users should only have access to the level of information necessary to perform their job responsibilities.\n   - **Policy on Generative AI**:\n     - Delta's policies regarding Generative AI usage remain subject to change.\n   - **Use of WeChat and Weibo**:\n     - The use of WeChat and Weibo is prohibited at Delta.\n   - **Operational Logistics**:\n     - Communication of operational logistics, including ROPs, is permitted.\n\n3. **Evaluation and Completion**:\n   - The course includes a summary and evaluation section.\n   - Users can verify course completion and receive a certificate.\n\n#### Additional Policies\n- **Delta Air Lines Policy on the Acceptable Use of Information Technology**\n- **Employee Personal Device Policy**\n\n#### URL\n- A URL is provided for further reading on the Delta Information Security website.\n\n#### Navigation\n- The course includes options for best practices, learning activities, summaries, messages from educators, and evaluations.\n\n### Visual Elements\n- **Thumbnail**: An image titled \"Information Security Awareness\" is displayed on the left side of the course page.\n- **Buttons**: Options to verify course completion and exit the course are located on the right side of the page.\n\n### Platform Interface\nThe platform interface includes a sidebar with navigation links and a main content area displaying the course material. Key elements include:\n\n- **Header**: Includes options for \"My Learning,\" \"Library,\" and a search bar for activities or people.\n- **Left Sidebar**: Contains sections such as \"Best Practices,\" \"Learning Activity,\" \"Summary,\" \"Message from Ed,\" and \"Evaluation.\"\n- **Main Content Area**: Displays the current section of the course, with interactive elements and visual aids.\n- **Right Sidebar**: Includes options to verify course completion and exit the course, along with a progress indicator.\n\n### Conclusion\nThe course is designed to ensure that Delta users are well-informed about information security practices, particularly in the context of using Generative AI tools and applications, and to comply with relevant policies and regulations. The platform provides a user-friendly interface with clear navigation and interactive elements to enhance the learning experience. The image depicts a screenshot of an online course titled \"Information Security Awareness - Standard (Recurrent)\" from My Career Portal, focusing on educating users about information security awareness.",
            "video_path": "/Information Security Awareness - Standard (Recurrent).mp4",
            "timestamp": "2025-03-20T18:58:41.467304",
            "labels": [
                "Cyber Risk",
                "Cyber Security Strategy",
                "Cyber Threat Intelligence",
                "Identity And Access Management",
                "Incident Response",
                "IT Risk Management ",
                "Network Security",
                "Regulatory Compliance",
                "Regulatory Requirements",
                "Risk Management",
                "Risk Mitigation",
                "Safety Assurance",
                "Safety Standards",
                "Safety Training",
                "Threat Assessment",
                "Vulnerability Assessments",
                "Vulnerability Management",
                "Workplace Safety"
            ]
        }
    ]
}